#include "mainWindow.h"

#include <qapplication.h>
#include <qwidget.h>

int main(int argc, char** argv) {
	QApplication app(argc, argv);
	MainWindow_C mainWindow;
	mainWindow.show();
	CreateTables();
	app.exec();
	return 0;
}

//todo: для пагінації можна додати класи два з яких відповідатимуть за логіку додавання кнопок, в цілому віджетів, і за налаштування
// а третій абстракний буде відповідати за стилі які можна передавати у пагінацію. Далі створити 4 (неабстракний клас, який успадкує всі абстракні
// і використовувати його для пагінації.

//todo: вікно про додаток (додати текст)
//todo: вікно про програму (її історія створення) (додати текст)

//todo: для пошуку можна додати рядок, в якому можна вводити всі дані студента 
//спеціальність, факультет, група і тд, можна викликати метод StudyButtonPressed передаючи параметри
//туди всі рядки які вводить користувач (ім'я, групу, факультет, спеціальність)